package com.ktcourse.lesson11

/**
 * Задание 1: Создание Пустого Словаря.
 * Создайте пустой неизменяемый словарь, где ключи и значения - целые числа.
 * /
/**
 * Задание 2: Создание и Инициализация Словаря.
 * Создайте словарь, инициализированный несколькими парами "ключ-значение", где ключи - float, а значения - double.
 * /
/**
 * Задание 3: Создание Изменяемого Словаря.
 * Создайте изменяемый словарь, где ключи - целые числа, а значения - строки.
 * /
/**
 * Задание 4: Добавление Элементов в Словарь.
 * Имея изменяемый словарь, добавьте в него новые пары "ключ-значение".
 * /
/**
 * Задание 5: Получение Значений из Словаря.
 * Используя словарь из предыдущего задания, извлеките значение, используя ключ. Попробуй получить значение с ключом, которого в словаре нет.
 * /
/**
 * Задание 6: Удаление Элементов из Словаря.
 * Удалите определенный элемент из изменяемого словаря по его ключу.
 * Словарь Библиотека. Ключи - автор книги, значения - список книг.
 * /
/**
 * Задание 7: Перебор Словаря в Цикле.
 * Создайте словарь (ключи Double, значения Int) и выведи в цикле результат деления ключа на значение.
 * Не забудь обработать деление на 0 (в этом случае выведи слово “бесконечность”).
 * /
/**
 * Задание 8: Перезапись Элементов Словаря.
 * Измените значение для существующего ключа в изменяемом словаре.
 * Четвертьфинала. Ключи - названия спортивных команд, значения - списки игроков каждой команды.
 * /
/**
 * Задание 9: Сложение Двух Словарей.
 * Создайте два словаря и объедините их в третьем изменяемом словаре через циклы.
 * Курс лечения. Ключи - даты, значения - список препаратов принимаемых в дату.
 * /
/**
 * Задание 10: Словарь со Сложными Типами.
 * Создайте словарь, где ключами являются строки, а значениями - списки целых чисел. Добавьте несколько элементов в этот словарь.
 * Словарь Путешественника. Ключи - страны, значения - словари из городов со списком интересных мест.
 * /
/**
 * Задание 11: Использование Множества в Качестве Значения.
 * Создай словарь, в котором ключи - это целые числа, а значения - изменяемые множества строк. Добавь данные в словарь.
 * Получи значение по ключу (это должно быть множество строк) и добавь в это множество ещё строку. Распечатай полученное множество.
 * /
/**
 * Задание 12: Поиск Элемента по Значению.
 * Создай словарь, где ключами будут пары чисел. Через перебор найди значение у которого пара будет содержать цифру 5 в качестве первого или второго значения.
 * Справочник Растений. Ключи - типы растений (например, "Цветы", "Деревья"), значения - списки названий растений.
 */